// 추가할 기능
// 1. 템 적용시키기 


#include<stdio.h>
#define NO 10
main()
{
	int b=1000,c=100,d,e,f=90;
	char n[100][50]={"구데기 검","쓰레기 검","목 검","평범한 검","단 검","장검","해적검","사랑검","장미 검","엑스칼리버"};
	int g[10]={100,200,300,500,1000,2000,3000,5000,8000,10000},s[3]={0,0,0};
	char a;
	srand(time(NULL));

	
	printf("\n\n\n\n\n                         --------------------------------------------------\n                         ㅣ                                              ㅣ\n                         ㅣ                                              ㅣ\n                         ㅣ                 돼지의 모험                  ㅣ\n                         ㅣ           게임을시작할건가요?(y/n)           ㅣ\n                         ㅣ                     ");
	printf("	                 ㅣ\n                         ㅣ                                              ㅣ\n                         ㅣ                                              ㅣ\n                         --------------------------------------------------\n                                                  ");
		do{
		a=getch();
	}while(a!='y'&&a!='Y'&&a!='n'&&a!='N');
	printf("%c",a);
	if(a!='y'&&a!='Y'){
		system("cls");
		printf("그럼 왜들어왓어 게이쉐기야");
	} 
	else
		{
	system("cls");
	a=0;
	for(;b>=100;){
		do{
		f=90; 
			printf("                                                                                                    용돈 : %d",b);
			printf("\n\n\n\n\n                         --------------------------------------------------\n                         ㅣ                                              ㅣ\n                         ㅣ                                              ㅣ\n                         ㅣ                 강화의 마을!                 ㅣ\n                         ㅣ            강화의 마을로 갈래?(y/n)          ㅣ\n                         ㅣ          (m : 상점)");
		 	printf("   (i : 인벤토리)         ㅣ\n                         ㅣ                                              ㅣ\n                         ㅣ                                              ㅣ\n                         --------------------------------------------------\n                                                  ");	
				 do{
			a=getch();
			}while(a!='y'&&a!='Y'&&a!='n'&&a!='N'&&a!='m'&&a!='M'&&a!='i'&&a!='I');
			if(a=='n'||a=='N')
			{
			break;
			}
			else if(a=='M'||a=='m')
			{
				do{
				system("cls");
				printf("                                                                                                    용돈 : %d \n\n\n\n\n                         --------------------------------------------------\n                         ㅣ                 상        점                 ㅣ\n                         ㅣ                                              ㅣ\n                         ㅣ               1. 5강 강화권:5000원           ㅣ\n                         ㅣ               2. 8강 강화권:23000원          ㅣ\n                         ㅣ               3. 즉 사 권  :???원   ",b);	
				printf("         ㅣ\n                         ㅣ                                              ㅣ\n                         ㅣ                                              ㅣ\n                         --------------------------------------------------\n                                                  ");	
				a=getch()-'0';
				if(a==1 && b>=5000){
					s[a-1]=s[a-1]+1;
					b=b-5000;
				} 
				else if(a==2 && b>=23000){
					s[a-1]=s[a-1]+1;
					b=b-23000;
				}
				else if(a==3){
				system("cls");
				printf("ㄷㄷ");
				break; 
			}
			}while(a != 29&&a !=61);
		}
				else if(a=='i'||a=='I')
				{
					system("cls");
				printf("\n\n\n\n\n                         --------------------------------------------------\n                         ㅣ                   인벤토리                   ㅣ\n                         ㅣ                           용돈 : %10d  ㅣ\n                         ㅣ 5강 강화권 %2d개                              ㅣ\n                         ㅣ 8강 강화권 %2d개                              ㅣ\n                         ㅣ 즉  사  권 %2d개                              ㅣ\n                         ㅣ                ",b,s[0],s[1],s[2]);
			 	printf("                              ㅣ\n                         ㅣ                                              ㅣ\n                         --------------------------------------------------\n                                                  ");		
				a=getch();
				}
			if(a==3)break;
			system("cls");
			}while(a!='y'&&a!='Y');
			if(a=='n'||a=='N'){
				break;
			}
			if(a==3)break;
			a=0;                                                                                                                                                                                                                                                                    
			do{
			system("cls");
			printf("\n\n\n\n\n                         --------------------------------------------------\n                         ㅣ          아이템을 사용하시겠습니까?          ㅣ\n                         ㅣ                           용돈 : %10d  ㅣ\n                         ㅣ 1. 5강 강화권 %2d개                           ㅣ\n                         ㅣ 2. 8강 강화권 %2d개                           ㅣ\n                         ㅣ 3. 즉  사  권 %2d개                           ㅣ\n                         ㅣ 4. 아이템없이 시작      ",b,s[0],s[1],s[2]);
		 	printf("                     ㅣ\n                         ㅣ                                              ㅣ\n                         --------------------------------------------------\n                                                  ");		
				do{
			a=getch();
			}while(a!='1'&&a!='2'&&a!='3'&&a!='4');
			if(a=="1"&&s[0]>0)
			{
				break;
			}
			}while(a!='4');
			system("cls");
			b-=100;
		for(c=0;b>=100;c++){
		 
		e=0+rand()%+100;	
		printf("                                                                                                    용돈 : %d",b);
		if(c==0)
		{
		printf("\n\n\n\n\n                         --------------------------------------------------\n                         ㅣ                                              ㅣ\n                         ㅣ                                              ㅣ\n                         ㅣ               칼 강화하기(100원)             ㅣ\n                         ㅣ    강화을시작할건가요?(강화 : y 팔기 : n)    ㅣ\n                         ㅣ                ");
		}
		else
		{
		printf("\n\n\n\n\n                         --------------------------------------------------\n                         ㅣ                ☆축하드립니다☆              ㅣ\n                         ㅣ 강화                                    성공 ㅣ\n                         ㅣ                  칼 강화하기                 ㅣ\n                         ㅣ    강화을시작할건가요?(강화 : y 팔기 : n)    ㅣ\n                         ㅣ                ");
		} 
		printf("%2d. %10s                ㅣ",c+1,n[c]); 
		printf("\n                         ㅣ                  확률 : %3d%%                 ㅣ\n                         ㅣ                  가격 : %4d                 ㅣ\n                         --------------------------------------------------\n                                                  ",f,g[c]);
	do{
		a=getch();
	}while((a!='y'&&a!='Y')&&(a!='n'&&a!='N'));
	printf("%c",a);
	if(a=='n'||a=='N'){
		system("cls");
		b=b+g[c];
		break;
	}
	else if(a=='y'||a=='Y'){
		if(e>f){
		system("cls");
		printf("\n\n\n\n\n                         --------------------------------------------------\n                         ㅣ실                                          패ㅣ\n                         ㅣ                                              ㅣ\n                         ㅣ                축하드려요!!!!                ㅣ\n                         ㅣ          캬캬캬캬캬컄캬캬캬컄캬ㅑㅋ          ㅣ\n                         ㅣ                ");
		printf("                              ㅣ\n                         ㅣ                    아무거나                  ㅣ\n                         ㅣ                      눌러                    ㅣ\n                         --------------------------------------------------\n                                                  ");
		a=getch();
		system("cls");
		break;
		}
		}
		f=f-10;
		system("cls");
		}}
	}
	if(b<=0)
	printf("파산~~~~~~~~~~~~~~");
	}

